title: Suspicious Use of Find - GTFObins
id: 668a71f0-38b2-4200-9077-796682c3d6df
status: experimental
description: Detects the use of find to spawn system shells or write files to the system
references:
    - https://gtfobins.github.io/gtfobins/find/
author: James Jolley
date: 2025-02-12
tags:
    - attack.privilege-escalation
    - attack.t1083 # File and Directory Discovery
    - attack.t1218 # System Binary Proxy Execution
logsource:
    category: process_creation
    product: linux
detection:
    bin:
        Image|endswith: '/find'
    cmdline_shell:
        CommandLine|contains: '-exec'
    cmdline_write:
        CommandLine|contains: '-fprintf'
    cmdline_bin:
        CommandLine|contains:
            - '/bin/sh'
            - '/bin/bash'
            - '/bin/zsh'
            - '/bin/fish'
            - '/bin/ksh'
            - '/bin/dash'
            - '/bin/tcsh'
            - '/bin/mksh'
            - '/bin/yash'
            - '/bin/xonsh'
    cmdline_sensitive:
        CommandLine|contains:
            - 'passwd'
            - 'shadow'
            - 'sudoers'
            - 'sshd_config'
            - 'authorized_keys'
            - 'hosts'
            - 'crontab'
    condition: bin and ((cmdline_shell and cmdline_bin) or (cmdline_write and cmdline_sensitive))
falsepositives:
    - Legitimate Administrative or user activity; unlikely
level: high