title: Suspicious Mshta execution using VBScript/JavaScript- LOLBAS
id: 15f043b7-0e35-4c8d-9450-536da6f8c6d7
status: experimental
description: Detects suspicious usage of mshta.exe which can be indicative of LOLBAS techniques for executing malicious scripts.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Mshta/
    - https://oddvar.moe/2017/12/21/applocker-case-study-how-insecure-is-it-really-part-2/
    
author: James Jolley
date: 2025-02-12
tags:
    - attack.execution
    - attack.t1218.005
    - attack.defense-evasion 
logsource:
    product: Windows
    category: process_creation
detection:
    selection_img:
        Image|endswith: '\mshta.exe'
        OriginalFileName: 'MSHTA.EXE'
    selection_sus:
        ParentImage|endswith:
            - '\cmd.exe'
            - '\cscript.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\regsvr32.exe'
            - '\rundll32.exe'
            - '\wscript.exe'
            - '\svchost.exe'
        CommandLine|contains:
            - 'GetObject'
            - 'http'
    selection_language:
        CommandLine|contains:
            - 'vbscript:createobject'
            - 'javascript'      
    filter_img:
        - Image|startswith:
            - 'C:\Windows\System32\'
            - 'C:\Windows\SysWOW64\'
        - CommandLine|contains:
            - '.htm'
            - '.hta'
        - CommandLine|endswith:
            - 'mshta.exe'
            - 'mshta'
    condition: selection_img and selection_sus and selection_language and not filter_img
falsepositives:
    - Legitimate administrative or software deployment activities that use mshta.exe.
level: high