title: Suspicious Base64 Encoded Powershell Command
id: 4bb0e8e0-34a4-4e8c-b9e0-8a3d059c1044
status: experimental
description: Detects base64 encoded powershell invocation of atomic red team test
references:
    - https://www.atomicredteam.io/atomic-red-team/atomics/T1059.001#atomic-test-15---athpowershellcommandlineparameter--encodedcommand-parameter-variations
author: James Jolley
date: 2025-02-24
tags:
    - attack.t1059.001
    - attack.execution
logsource:
  category: process_creation
  product: windows
detection:
    selection_img:
        Image|endswith: '\powershell.exe'
        ParentImage|endswith: '\WmiPrvSE.exe'
    selection_enc:
        CommandLine|re: (?i) /e(?:c|ncodedcommand|ncodedcomman|ncodedcomma|ncodedcomm|ncodedcom|ncodedco|ncodedc|ncoded|ncode|ncod|nco|nc|n)?
    condition: all of selection_*
falsepositives:
    - Unknown
level: high